app/controllers/articles_controller.rb

  def index
    @article = Article.all
---
SELECT `articles`.* FROM `articles`

  def show
    @article = Article.find(
    params[:id]
    )
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 16 LIMIT 1

  def edit
    @article = Article.find(
      params[:id]
      )
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 2 LIMIT 1

  def create
    @article = Article.new(params.require(:article).permit(:title, :description))
    # render plain: @article
    if @article.save
---
INSERT INTO `articles` (`title`, `created_at`, `updated_at`) VALUES ('hvjhjvhgfvghfvh', '2023-02-01 04:45:19.765764', '2023-02-01 04:45:19.765764')

  def update
    @article = Article.find(params[:id])
    if @article.update(params.require(:article).permit(:title, :description))
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 2 LIMIT 1
UPDATE `articles` SET `articles`.`title` = 'Some articleee', `articles`.`updated_at` = '2023-01-31 18:43:14.367870' WHERE `articles`.`id` = 2

  def destroy
    @article = Article.find(params[:id])
    @article.destroy
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 2 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 2